//=============================================================================
//
// 読み込みクラス [loadData.h]
// Author : 小笠原　彪我
//
//=============================================================================
#ifndef _LOADDATA_H_
#define _LOADDATA_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "manager.h"

//*****************************************************************************
//	前方宣言
//*****************************************************************************
class CModel;

//*****************************************************************************
//	読み込みクラス
//*****************************************************************************
class CLoadData
{
public:
	CLoadData();		// コンストラクタ
	~CLoadData();		// デストラクタ

	HRESULT Init(void);	// 初期化処理
	void Uninit(void);	// 終了処理

	// 取得処理
	static CModel *GetModel(int nCntModel) { return m_pModel[nCntModel]; }	// モデルのポインタ
	static int GetNumModel(void) { return m_nNumModel; }	// モデル数

	// 設定処理
	static void LoadModel(const char *pPathName);	// モデルファイル読み込み

private:
	static CModel *m_pModel[32];	// モデルのポインタ
	static int m_nNumModel;			// モデル数
};
#endif	//!_LOADDATA_H_