//=============================================================================
//
// テクスチャクラス [texture.h]
// Author : 小笠原　彪我
//
//=============================================================================
#ifndef _TEXTURE_H_
#define _TEXTURE_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "manager.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define FILENAME_TEXTURE "data/LOADFILE/texture.txt"
#define MAX_TEXTURE 30
//*****************************************************************************
//	テクスチャクラス
//*****************************************************************************
class CTexture
{
public:
	//テクスチャの種類
	typedef enum
	{
		TYPE_FIELD = 0,	// フィールド
		TYPE_MAX		// テクスチャの最大数
	} TEXTURE;

	CTexture();			// コンストラクタ
	~CTexture();		// デストラクタ

	HRESULT Init(void);	// 初期化処理
	void Uninit(void);	// 終了処理

	static LPDIRECT3DTEXTURE9 SetTexture(int nType) {return m_apTexture[nType]; }	// テクスチャの種類を設定

private:
	static LPDIRECT3DTEXTURE9	m_apTexture[MAX_TEXTURE];	// テクスチャのポインタ
	static int					m_nType;				// 種類数
	int							m_nNumTexture;			// 種類の総数
};
#endif //!_TEXTURE_H_