//=============================================================================
//
// UIクラス [UI.h]
// Author : 小笠原　彪我
//
//=============================================================================
#ifndef _UI_H_
#define _UI_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "manager.h"
#include "scene2D.h"

//=============================================================================
// マクロ定義
//=============================================================================

//*****************************************************************************
//	UIクラス
//*****************************************************************************
class CUI : public CScene2D
{
public:
	CUI(int nPriority = PRIORITY_UI);		// コンストラクタ
	~CUI();				// デストラクタ

	HRESULT Init(void);	// 初期化処理
	void Uninit(void);	// 終了処理
	void Update(void);	// 更新処理
	void Draw(void);	// 描画処理

	// 生成処理
	static CUI *Create(D3DXVECTOR3 pos, D3DXVECTOR3 size, D3DXVECTOR3 move, int nType);

private:
	D3DXVECTOR3 m_pos;	// 位置
	D3DXVECTOR3 m_size;	// 大きさ
	D3DXVECTOR3 m_move;	// 移動量
	int			m_nType;// テクスチャの種類

};
#endif //!_UI_H_