//=============================================================================
//
// Xファイル読み込みクラス [Xload.h]
// Author : 小笠原　彪我
//
//=============================================================================
#ifndef _XLOAD_H_
#define _XLOAD_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "manager.h"

//=============================================================================
// マクロ定義
//=============================================================================
//*****************************************************************************
//	テクスチャクラス
//*****************************************************************************
class CXload
{
public:
	CXload();		// コンストラクタ
	~CXload();		// デストラクタ

	HRESULT Init(void);	// 初期化処理
	void Uninit(void);	// 終了処理

	// 取得処理
	LPD3DXMESH GetMesh(int nType) { return m_pMesh[nType]; }
	LPD3DXBUFFER GetBuffMat(int nType) { return m_pBuffMat[nType]; }
	DWORD GetNumMat(int nType) { return m_nNumMat[nType]; }

private:
	LPD3DXMESH		m_pMesh[5];		// メッシュ（頂点情報）へのポインタ
	LPD3DXBUFFER	m_pBuffMat[5];	// マテリアル（材質情報）へのポインタ
	DWORD			m_nNumMat[5];	// マトリックス数
	int				m_nType;		// 種類
};
#endif //!_XLOAD_H_